#define _CRT_SECURE_NO_WARNINGS 
#include <stdio.h>

int main()
{
	//Test 1 1개의 숫자를 입력받아서 짝수, 홀수인지 체크하는 프로그램 작성
	//나머지 연산자 활용
	
	

	//Test 2 2개의 숫자를 입력받아서 크가,작다,같다를 체크하는 프로그램 작성
	


	//Test 3 국어, 영어, 수학 점수를 입력받아서 총점, 평균, 학점을 구하는 프로그램작성
	// 학점: 100~90:A학점, 89~80:B학점 79~70:C학점 69~60:D학점 59~0:F학점


	//Test 4 1) 간단한 계산기. (if  switch 둘다가능)
	//1. 2개의 숫자를 입력박고, 문자 +, -, *, / 를 입력받음.
	//2. 출력 형태는 아래를 참고
	// >>> 동작 예시 <<<
	// 1번째 숫자 입력: 10
	// 2번째 숫자 입력: 20
	// 연산자 입력(+,-,*,/): +

	// >>> 출력 예시 <<<
	// 10 + 5 = 15


	//Test 5 2) 윤년 구분하는 프로그램 (switch 사용 불가)
	//1. 입력한 년도를 4로 나누면 나머지가 0이고, 100으로 나누면 0이 아님. -> 윤년
	//2. 입력한 년도를 400으로 나누면 나머지가 0 -> 윤년

/* Test 6 아래의 메뉴를 선택하여 출력.
	조건1)메뉴 선택은 문자로 입력 처리.
	조건2)프로그램 출력은 아래와 같은 형식으로 하기 바람.
	-------------------------------------
	   식당 메뉴 자동 주문 프로그램 v1.0
	-------------------------------------
	원하는 식사를 선택하세요.
	a. 김치찌개 : 5,000원
	b. 된장찌개 : 5,000원
	c. 칼국수   : 4,500원
	d. 잔치국수 : 4,000원
	e.비빔밥    : 5,000원
	-------------------------------------
	메뉴를 선택하세요 : c
	비빔밥을 주문했습니다. */

	/* test7 자판기에서 담배를 선택하여 출력하는 프로그램.
	조건1) 자판기에 입력한 금액에 대한 거스름돈 처리 필요.
	-------------------------------------
	담배 자판기 프로그램 v.1.0
	-------------------------------------
	원하는 을료수를 메뉴에서 선택하세요.
	1. 에쎄 골든 리프 6,000원
	2. 에쎄 스페셜 골드 5,000원
	3. 더원 블루 4,500원
	4. 더원 오렌지 4,500원
	5. 더원 화이트 4,500원
	-------------------------------------
	담배를 선택하시오 => 5
	더원 화이트를 선택하셨습니다.
	-------------------------------------
	담배 금액을 입금하세요 => 10,000
	더원 화이트를 구매했습니다. 거스름돈 5,500원을 받으세요.
	*/

	// test 8 3개의 숫자를 입력받아서 홀수,짝수 구분하기.
	//조건) 반복문을 사용해서 입력받기

	// test 9 1~100 까지의 숫자 중에서 5의 배수만 출력하기.
	//조건) 반복문 for, while 사용하기







}