#include <stdio.h>

int main()

{
    /* test1 변수에 저장된 정보들을 서식문자를 사용하여 출력하기
    * 
    정수형 변수 a에 100을 저장
    정수형 변수 b에 4가 저장
    실수형 변수 c에 3.14 저장
    문자형 변수 d에 B가 저장
     문자열변수 e에 이현오 저장
    

    test 2 서식문자로 출력하기

---------------------------------
        수강생 정보 확인서    
---------------------------------
    이름 : 이현오
    나이 : 200
    번호 : 010-1234-4321
    주소 : 대구광역시 수성구 시지로21
    키 : 182.1cm
    몸무게 : 84.5kg
    혈액형 :O형

---------------------------------

    test 3 덧셈 뺄샘 곱셈 나눗셈 몫 나머지 결과 출력하기
    a = 100
    b = 200



*/


}