#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
int main()
{	
	// test 1
	
	//1. 원주율PI를 저장하는 실수형 상수 변수를 생성하고 값을 설정(PI=3.14)
	//2. 원의 반지름을 저장하는 실수형 변수를 생성하고 입력 받기
	//3. 원의 면적을 출력하기(반지름 * 반지름 * PI = 원의 면적)


	// test2
	 
	// 1. 국어, 영어, 수학, 과학 정수형 변수 생성
	// 2. 국어, 영어, 수학, 과학 점수 입력 받기
	// 3. 모든 과목의 평균값과 총점을 저장할 변수를 생성
	// 4. 평균값과 총점을 출력



	// test3
	 
	// 1.화씨 온도를 저장하는 정수형 변수 생성
	// 2.화씨 온도를 입력 받기
	// 3.섭씨 온도를 저장하는 실수형 변수 생성
	// 4.화씨 온도를 섭씨 온도로 변환하세요 섭씨온도=(화씨온도 - 32) / 1.8
	// 5.섭씨 온도를 출력

	// test4

	/* 동전 교환기 프로그램 만들기
	동전은 각각 500원, 100원, 50원, 10원이 사용됨
	동전의 각각의 갯수를 저장할 변수들을 만들고 초기값 0으로 설정.
	특정 금액의 입력받으세요.(예: 1370)
	지폐를 500원 동전 갯수 구함
	나머지 금액이 있으면 100원 동전 갯수 구함
	나머지 금액이 있으면 50원 동전 갯수 구함
	나머지 금액이 있으면 10원 동전 갯수 구함
	반드시 아래와 같은 형태로 출력하기 바람

	------------------------------------------
			동전 교환기 프로그램 v1.0
	------------------------------------------
			오백원 갯수 : ? 개
			백원 갯수 : ? 개
			오십원 갯수 : ? 개
			십원 갯수 : ? 개
			바꾸지 못한 잔돈 : ? 개

	------------------------------------------
	*/
	
}