#define _CRT_SECURE_NO_WARNINGS 
#include <stdio.h>
	// test 1
	// 1~5까지 연속적으로 매개변수로 전달하여
	// 출력하는 함수 작성
	// 함수명: show_num
	// 
	// test 2 
	// main()에서 1~7 사이의 숫자를 입력 받아서
	// 매개변수로 전달하여 매개변수의 값이
	// 1이면, 월요일 출력.
	// 2이면, 화요일 출력.
	// ...
	// 7이면, 일요일 출력하는 함수 작성
	//함수명 show_day

	// test 3 
	// 1. 3개의 정수를 main()에서 입력받아서 한꺼번에 매개변수에 전달
	// 2. 함수에서 3개의 숫자를 크기 순서대로 출력
	// 3. 함수 이름: my_sort()
	// 4. n1 > n2 > n3 -->
	// 5. 출력 결과: n1 > n2 > n3

// test 4
	// 정수 2개와 사칙연산자를 main()에서 입력받음.
	// 사칙연산자는 문자로 입력받음.(+, -, x, /)
	// 3개의 정보를 매개변수로 전달
	// 계산결과값을 리턴하여 main()에서 출력하기
// test 5
	// 1. 구구단을 출력하는 숫자를 main()에서 입력 받음
	// 2. ex) 3을 입력받아 매개변수를 전달하면 3단 출력
	// 3. 입력받은 숫자를 매개변수로 전달하여 함수에서 구구단 출력하기

// test 6
	// 국,영,수 점수를 입력받아서 총점, 평균값을 구하는 프로그램
	// 조건1) 점수 입력은 main()에서 입력 받음
	// 조건2) 입력받는 점수는 0~100 사이의 숫자만 입력받도록 조건 체크하기
			//---> 간단하게 한번만 체크하면 됨(사용자가 실수로 잘못입력하면 에러메세지 출력후 종료 처리)
	// 조건3) 국,영,수 점수를 각각의 매개변수로 전달하여 총점, 평균값을 출력하는 메쏘드 작성
	// 조건4) 조건 3까지 테스트 완료 이후에 잘못입력값 체크를 확장하기(실수로 입력하면 재입력 받을수 있도록 처리)

int main()
{

}